# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [9]:
series1 = pd.Series(np.random.randint(low=1, high=5, size=100))
series2 = pd.Series(np.random.randint(low=1, high=4, size=100))
series3 = pd.Series(np.random.randint(low=10000, high=30001, size=100))
series1

0     2
1     1
2     2
3     3
4     1
     ..
95    2
96    2
97    2
98    1
99    1
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [28]:
house = pd.DataFrame(data = [series1, series2, series3]).T
house.head()

   0  1      2
0  2  2  23768
1  1  1  12216
2  2  3  15060
3  3  1  17366
4  1  1  15203

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [36]:
house = house.rename(columns={0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'})

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [60]:
bigcolumn = pd.concat([series1,series2,series3]).to_frame()
bigcolumn

        0
0       2
1       1
2       2
3       3
4       1
..    ...
95  16501
96  21533
97  20258
98  14250
99  17547

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [63]:
bigcolumn.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 300 entries, 0 to 99
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       300 non-null    int64
dtypes: int64(1)
memory usage: 4.7 KB

In [77]:
bigcolumn.shape

(300, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [81]:
bigcolumn.set_index(np.arange(300))

         0
0        2
1        1
2        2
3        3
4        1
..     ...
295  16501
296  21533
297  20258
298  14250
299  17547

[300 rows x 1 columns]